/* eslint-disable */

// 几个省份具体到市的品种存栏数据

let r = () => Math.round(Math.random() * 1234)

export default [
  {
    name: '山东',
    value: [
      {"name":"烟台市","hong":"89.3 ","fen":"1.2 ","bai":"0.0 ","all":"90.5 "},
      {"name":"临沂市","hong":"206.3 ","fen":"34.1 ","bai":"0.5 ","all":"241.0 "},
      {"name":"潍坊市","hong":"224.5 ","fen":"6.1 ","bai":"0.0 ","all":"230.6 "},
      {"name":"青岛市","hong":"393.5 ","fen":"16.1 ","bai":"0.0 ","all":"409.6 "},
      {"name":"菏泽市","hong":"306.4 ","fen":"37.3 ","bai":"500.7 ","all":"844.3 "},
      {"name":"济宁市","hong":"151.0 ","fen":"37.8 ","bai":"0.6 ","all":"189.4 "},
      {"name":"德州市","hong":"215.4 ","fen":"21.6 ","bai":"29.9 ","all":"267.0 "},
      {"name":"滨州市","hong":"418.4 ","fen":"2.9 ","bai":"5.0 ","all":"426.3 "},
      {"name":"聊城市","hong":"230.7 ","fen":"62.5 ","bai":"26.5 ","all":"319.6 "},
      {"name":"东营市","hong":"9.2 ","fen":"0.0 ","bai":"0.0 ","all":"9.2 "},
      {"name":"济南市","hong":"119.3 ","fen":"40.0 ","bai":"18.2 ","all":"177.4 "},
      {"name":"泰安市","hong":"31.7 ","fen":"0.6 ","bai":"6.4 ","all":"38.7 "},
      {"name":"威海市","hong":"13.4 ","fen":"0.0 ","bai":"0.0 ","all":"13.4 "},
      {"name":"日照市","hong":"40.9 ","fen":"0.3 ","bai":"0.0 ","all":"41.2 "},
      {"name":"淄博市","hong":"141.5 ","fen":"4.2 ","bai":"0.0 ","all":"145.7 "},
      {"name":"枣庄市","hong":"56.6 ","fen":"2.0 ","bai":"0.0 ","all":"58.6 "},
      {"name":"莱芜市","hong":"82.8 ","fen":"31.8 ","bai":"0.5 ","all":"115.1 "}
    ]
  },
  {
    name: '江苏',
    value: [
      {"name":"盐城市","hong":"497.6 ","fen":"21.8 ","bai":"0.0 ","all":"519.3 "},
      {"name":"徐州市","hong":"188.5 ","fen":"12.3 ","bai":"0.0 ","all":"200.8 "},
      {"name":"南通市","hong":"146.6 ","fen":"3.0 ","bai":"0.0 ","all":"149.6 "},
      {"name":"淮安市","hong":"38.4 ","fen":"14.0 ","bai":"0.0 ","all":"52.4 "},
      {"name":"苏州市","hong":"0.0 ","fen":"0.0 ","bai":"0.0 ","all":"0.0 "},
      {"name":"宿迁市","hong":"89.1 ","fen":"2.8 ","bai":"0.0 ","all":"91.9 "},
      {"name":"连云港市","hong":"16.2 ","fen":"0.8 ","bai":"0.0 ","all":"17.0 "},
      {"name":"扬州市","hong":"12.7 ","fen":"4.0 ","bai":"0.0 ","all":"16.7 "},
      {"name":"南京市","hong":"64.0 ","fen":"0.3 ","bai":"0.0 ","all":"64.3 "},
      {"name":"泰州市","hong":"303.4 ","fen":"8.2 ","bai":"0.0 ","all":"311.5 "},
      {"name":"无锡市","hong":"0.0 ","fen":"0.0 ","bai":"0.0 ","all":"0.0 "},
      {"name":"常州市","hong":"0.0 ","fen":"0.0 ","bai":"0.0 ","all":"0.0 "},
      {"name":"镇江市","hong":"0.0 ","fen":"0.0 ","bai":"0.0 ","all":"0.0 "}
    ]
  },
  {
    name: '河北',
    value: [
      {"name":"承德市","hong":"64.4 ","fen":"0.0 ","bai":"0.0 ","all":"64.4 "},
      {"name":"张家口市","hong":"259.4 ","fen":"0.0 ","bai":"1.3 ","all":"260.8 "},
      {"name":"保定市","hong":"378.1 ","fen":"317.8 ","bai":"0.0 ","all":"695.8 "},
      {"name":"唐山市","hong":"396.8 ","fen":"4.9 ","bai":"0.0 ","all":"401.7 "},
      {"name":"沧州市","hong":"110.3 ","fen":"270.1 ","bai":"0.5 ","all":"380.8 "},
      {"name":"石家庄市","hong":"152.1 ","fen":"431.8 ","bai":"0.0 ","all":"583.9 "},
      {"name":"邢台市","hong":"104.8 ","fen":"316.0 ","bai":"0.0 ","all":"420.8 "},
      {"name":"邯郸市","hong":"21.0 ","fen":"965.2 ","bai":"11.8 ","all":"998.0 "},
      {"name":"秦皇岛市","hong":"42.6 ","fen":"0.0 ","bai":"0.0 ","all":"42.6 "},
      {"name":"衡水市","hong":"9.4 ","fen":"344.4 ","bai":"8.6 ","all":"362.4 "},
      {"name":"廊坊市","hong":"167.9 ","fen":"92.4 ","bai":"0.0 ","all":"260.3 "}
    ]
  },
  {
    name: '湖北',
    value: [
      {"name":"恩施土家族苗族自治州","hong":"0.0 ","fen":"0.0 ","bai":"0.0 ","all":"0.0 "},
      {"name":"十堰市","hong":"0.0 ","fen":"0.5 ","bai":"0.0 ","all":"0.5 "},
      {"name":"宜昌市","hong":"22.3 ","fen":"85.7 ","bai":"0.0 ","all":"108.0 "},
      {"name":"襄樊市","hong":"0.0 ","fen":"0.0 ","bai":"0.0 ","all":"0.0 "},
      {"name":"黄冈市","hong":"55.0 ","fen":"223.6 ","bai":"0.0 ","all":"278.6 "},
      {"name":"荆州市","hong":"206.4 ","fen":"160.9 ","bai":"0.7 ","all":"368.1 "},
      {"name":"荆门市","hong":"214.1 ","fen":"37.6 ","bai":"0.0 ","all":"251.7 "},
      {"name":"咸宁市","hong":"0.0 ","fen":"2.0 ","bai":"0.0 ","all":"2.0 "},
      {"name":"随州市","hong":"75.4 ","fen":"41.7 ","bai":"1.9 ","all":"119.0 "},
      {"name":"孝感市","hong":"212.2 ","fen":"400.0 ","bai":"1.0 ","all":"613.2 "},
      {"name":"武汉市","hong":"95.8 ","fen":"61.9 ","bai":"0.0 ","all":"157.7 "},
      {"name":"黄石市","hong":"0.0 ","fen":"0.7 ","bai":"0.0 ","all":"0.7 "},
      {"name":"神农架林区","hong":"0.0 ","fen":"0.0 ","bai":"0.0 ","all":"0.0 "},
      {"name":"天门市","hong":"0.0 ","fen":"0.0 ","bai":"0.0 ","all":"0.0 "},
      {"name":"仙桃市","hong":"34.7 ","fen":"511.1 ","bai":"0.0 ","all":"545.8 "},
      {"name":"潜江市","hong":"0.0 ","fen":"0.0 ","bai":"0.0 ","all":"0.0 "},
      {"name":"鄂州市","hong":"0.0 ","fen":"46.6 ","bai":"0.0 ","all":"46.6 "}
    ]
  },
  {
    name: '辽宁',
    value: [
      {"name":"大连市","hong":"183.4 ","fen":"0.0 ","bai":"0.0 ","all":"183.4 "},
      {"name":"朝阳市","hong":"194.9 ","fen":"1.6 ","bai":"0.5 ","all":"197.0 "},
      {"name":"丹东市","hong":"195.3 ","fen":"0.8 ","bai":"0.0 ","all":"196.1 "},
      {"name":"铁岭市","hong":"87.1 ","fen":"1.5 ","bai":"0.0 ","all":"88.7 "},
      {"name":"沈阳市","hong":"90.6 ","fen":"8.3 ","bai":"0.0 ","all":"98.8 "},
      {"name":"抚顺市","hong":"5.2 ","fen":"0.4 ","bai":"0.0 ","all":"5.6 "},
      {"name":"葫芦岛市","hong":"9.0 ","fen":"0.0 ","bai":"0.0 ","all":"9.0 "},
      {"name":"阜新市","hong":"4.8 ","fen":"0.0 ","bai":"0.0 ","all":"4.8 "},
      {"name":"锦州市","hong":"20.5 ","fen":"1.3 ","bai":"0.0 ","all":"21.9 "},
      {"name":"鞍山市","hong":"129.2 ","fen":"3.5 ","bai":"0.0 ","all":"132.7 "},
      {"name":"本溪市","hong":"2.4 ","fen":"0.0 ","bai":"0.0 ","all":"2.4 "},
      {"name":"营口市","hong":"51.7 ","fen":"0.0 ","bai":"0.0 ","all":"51.7 "},
      {"name":"辽阳市","hong":"28.3 ","fen":"0.0 ","bai":"0.0 ","all":"28.3 "},
      {"name":"盘锦市","hong":"8.5 ","fen":"0.0 ","bai":"0.0 ","all":"8.5 "}
    ]
  }
]