/* eslint-disable */

// 此数据会被用在r1区域 是 产蛋 日耗料 淘汰鸡 疫苗
// 目前只有五个省份有数据

export default [
  {"name":"山东","type":"all","cd":"263 ","hl":"571 ","tt":"13509 "},
  {"name":"山东","type":"hong","cd":"231 ","hl":"502 ","tt":"11875 "},
  {"name":"山东","type":"bai","cd":"14 ","hl":"31 ","tt":"741 "},
  {"name":"山东","type":"fen","cd":"17 ","hl":"38 ","tt":"893 "},
  {"name":"江苏","type":"all","cd":"142 ","hl":"309 ","tt":"7315 "},
  {"name":"江苏","type":"hong","cd":"122 ","hl":"265 ","tt":"6270 "},
  {"name":"江苏","type":"bai","cd":"20 ","hl":"44 ","tt":"1045 "},
  {"name":"江苏","type":"fen","cd":"0 ","hl":"0 ","tt":"0 "},
  {"name":"河北","type":"all","cd":"262 ","hl":"569 ","tt":"13452 "},
  {"name":"河北","type":"hong","cd":"101 ","hl":"220 ","tt":"5206 "},
  {"name":"河北","type":"bai","cd":"154 ","hl":"333 ","tt":"7885 "},
  {"name":"河北","type":"fen","cd":"7 ","hl":"15 ","tt":"361 "},
  {"name":"湖北","type":"all","cd":"163 ","hl":"353 ","tt":"8360 "},
  {"name":"湖北","type":"hong","cd":"61 ","hl":"132 ","tt":"3135 "},
  {"name":"湖北","type":"bai","cd":"102 ","hl":"221 ","tt":"5225 "},
  {"name":"湖北","type":"fen","cd":"0 ","hl":"0 ","tt":"0 "},
  {"name":"辽宁","type":"all","cd":"122 ","hl":"264 ","tt":"6246 "},
  {"name":"辽宁","type":"hong","cd":"120 ","hl":"261 ","tt":"6175 "},
  {"name":"辽宁","type":"bai","cd":"1 ","hl":"2 ","tt":"57 "},
  {"name":"辽宁","type":"fen","cd":"0 ","hl":"1 ","tt":"14 "}
]