/* eslint-disable */

// 此数据会被用在r1区域 是 产蛋 日耗料 淘汰鸡 疫苗
// 目前只有五个省份有数据

export default [
  {"name":"山东省","type":"all","cd":"150.55","hl":"326.74","tt":"7731.1"},
  {"name":"山东省","type":"hong","cd":"116.84","hl":"253.57","tt":"5999.78"},
  {"name":"山东省","type":"fen","cd":"12.08","hl":"26.22","tt":"620.41"},
  {"name":"山东省","type":"bai","cd":"21.63","hl":"46.95","tt":"1110.91"},
  {"name":"江苏省","type":"all","cd":"65.14","hl":"141.37","tt":"3344.95"},
  {"name":"江苏省","type":"hong","cd":"60.12","hl":"130.47","tt":"3087.18"},
  {"name":"江苏省","type":"fen","cd":"28.63","hl":"62.13","tt":"1470.03"},
  {"name":"江苏省","type":"bai","cd":"0.07","hl":"0.16","tt":"3.80"},
  {"name":"河北省","type":"all","cd":"173.29","hl":"376.09","tt":"8898.65"},
  {"name":"河北省","type":"hong","cd":"74.16","hl":"160.94","tt":"3808.14"},
  {"name":"河北省","type":"fen","cd":"97.90","hl":"212.48","tt":"5027.52"},
  {"name":"河北省","type":"bai","cd":"0.93","hl":"2.03","tt":"48.00"},
  {"name":"湖北省","type":"all","cd":"97.90","hl":"212.47","tt":"5027.40"},
  {"name":"湖北省","type":"hong","cd":"46.11","hl":"100.07","tt":"2367.76"},
  {"name":"湖北省","type":"fen","cd":"51.56","hl":"111.89","tt":"2647.53"},
  {"name":"湖北省","type":"bai","cd":"0.24","hl":"0.51","tt":"12.11"},
  {"name":"辽宁省","type":"all","cd":"47.55","hl":"103.19","tt":"2441.50"},
  {"name":"辽宁省","type":"hong","cd":"42.51","hl":"92.26","tt":"2182.90"},
  {"name":"辽宁省","type":"fen","cd":"4.76","hl":"10.33","tt":"244.48"},
  {"name":"辽宁省","type":"bai","cd":"0.28","hl":"0.60","tt":"14.13"}
]