/* eslint-disable */

// 此数据会被用在地图下方的 产蛋 日耗料 淘汰鸡 数据中
// 此数据还会被用在主地图的标题上

export default [
  // {"name":"all","cd":"1828 ","hl":"3967 ","tt":"93860 ","cl":"98800 "},
  // {"name":"hong","cd":"1252 ","hl":"2717 ","tt":"64283 ","cl":"67666 "},
  // {"name":"bai","cd":"545 ","hl":"1182 ","tt":"27967 ","cl":"29439 "},
  // {"name":"fen","cd":"31 ","hl":"68 ","tt":"1609 ","cl":"1694 "}
  {"name":"all","cd":"1019 ","hl":"2213 ","tt":"52351 "},
  {"name":"hong","cd":"705 ","hl":"1529 ","tt":"36184 "},
  {"name":"fen","cd":"289 ","hl":"626 ","tt":"14816 "},
  {"name":"bai","cd":"26 ","hl":"57 ","tt":"1351 "}
]