export default [
  {
    name: '北京市 - 顺义区',
    value: [116.659699, 40.137896]
  },
  {
    name: '北京市 - 平谷区',
    value: [117.126804, 40.147172]
  },
  {
    name: '北京市 - 密云区',
    value: [116.850122, 40.381516]
  },
  {
    name: '天津市 - 宝坻区',
    value: [117.316601, 39.72386]
  },
  {
    name: '天津市 - 宁河区',
    value: [117.833543, 39.337179]
  },
  {
    name: '天津市 - 蓟州区',
    value: [117.411704, 40.05173]
  },
  {
    name: '石家庄市 - 藁城区',
    value: [114.849929, 38.028954]
  },
  {
    name: '石家庄市 - 栾城区',
    value: [114.655151, 37.904677]
  },
  {
    name: '石家庄市 - 元氏县',
    value: [114.532566, 37.771654]
  },
  {
    name: '石家庄市 - 辛集市',
    value: [115.223876, 37.948171]
  },
  {
    name: '石家庄市 - 新乐市',
    value: [114.687657, 38.349519]
  },
  {
    name: '唐山市 - 丰润区',
    value: [118.168541, 39.837245]
  },
  {
    name: '唐山市 - 玉田县',
    value: [117.697716, 39.982044]
  },
  {
    name: '唐山市 - 遵化市',
    value: [117.97065, 40.194872]
  },
  {
    name: '秦皇岛市 - 抚宁区',
    value: [119.250974, 39.88075]
  },
  {
    name: '邯郸市 - 大名县',
    value: [115.152888, 36.291521]
  },
  {
    name: '邯郸市 - 涉县',
    value: [113.696434, 36.590924]
  },
  {
    name: '邯郸市 - 磁县',
    value: [114.380432, 36.380591]
  },
  {
    name: '邯郸市 - 邱县',
    value: [115.19052, 36.817131]
  },
  {
    name: '邯郸市 - 馆陶县',
    value: [115.289112, 36.553725]
  },
  {
    name: '邯郸市 - 魏县',
    value: [114.942001, 36.364528]
  },
  {
    name: '邢台市 - 隆尧县',
    value: [114.781215, 37.356482]
  },
  {
    name: '邢台市 - 南和县',
    value: [114.689398, 37.010306]
  },
  {
    name: '邢台市 - 巨鹿县',
    value: [115.047036, 37.228237]
  },
  {
    name: '保定市 - 满城区',
    value: [115.32665, 38.956115]
  },
  {
    name: '保定市 - 唐县',
    value: [114.988872, 38.754695]
  },
  {
    name: '保定市 - 雄县',
    value: [116.115751, 39.001302]
  },
  {
    name: '保定市 - 定州市',
    value: [114.998221, 38.521522]
  },
  {
    name: '张家口市 - 蔚县',
    value: [114.594826, 39.847311]
  },
  {
    name: '张家口市 - 怀来县',
    value: [115.523978, 40.42007]
  },
  {
    name: '沧州市 - 肃宁县',
    value: [115.837093, 38.42868]
  },
  {
    name: '沧州市 - 泊头市',
    value: [116.584628, 38.089484]
  },
  {
    name: '沧州市 - 黄骅市',
    value: [117.337631, 38.37772]
  },
  {
    name: '廊坊市 - 香河县',
    value: [117.014127, 39.767717]
  },
  {
    name: '衡水市 - 饶阳县',
    value: [115.733147, 38.240358]
  },
  {
    name: '衡水市 - 景县',
    value: [116.275111, 37.6995]
  },
  {
    name: '衡水市 - 阜城县',
    value: [116.181272, 37.869416]
  },
  {
    name: '大同市 - 大同县',
    value: [113.617896, 40.046009]
  },
  {
    name: '长治市 - 长治县',
    value: [113.058566, 36.058119]
  },
  {
    name: '长治市 - 屯留县',
    value: [112.8979, 36.320468]
  },
  {
    name: '晋中市 - 榆次区',
    value: [112.715654, 37.705082]
  },
  {
    name: '晋中市 - 昔阳县',
    value: [113.714188, 37.617198]
  },
  {
    name: '晋中市 - 祁县',
    value: [112.341292, 37.36436]
  },
  {
    name: '运城市 - 稷山县',
    value: [110.98999, 35.610168]
  },
  {
    name: '呼和浩特市 - 玉泉区',
    value: [111.681, 40.75784]
  },
  {
    name: '赤峰市 - 松山区',
    value: [118.939414, 42.292268]
  },
  {
    name: '赤峰市 - 宁城县',
    value: [119.349459, 41.599598]
  },
  {
    name: '赤峰市 - 敖汉旗',
    value: [119.929878, 42.296293]
  },
  {
    name: '巴彦淖尔市 - 临河区',
    value: [107.366659, 40.757337]
  },
  {
    name: '沈阳市 - 新民市',
    value: [122.860447, 42.033903]
  },
  {
    name: '大连市 - 普兰店区',
    value: [121.94531, 39.39965]
  },
  {
    name: '鞍山市 - 海城市',
    value: [122.697318, 40.886107]
  },
  {
    name: '丹东市 - 凤城市',
    value: [124.070697, 40.458521]
  },
  {
    name: '营口市 - 盖州市',
    value: [122.355591, 40.404629]
  },
  {
    name: '朝阳市 - 建平县',
    value: [119.65053, 41.408374]
  },
  {
    name: '长春市 - 德惠市',
    value: [125.737964, 44.525722]
  },
  {
    name: '四平市 - 梨树县',
    value: [124.338951, 43.313976]
  },
  {
    name: '通化市 - 通化县',
    value: [125.763667, 41.686759]
  },
  {
    name: '松原市 - 长岭县',
    value: [123.974949, 44.281432]
  },
  {
    name: '白城市 - 洮北区',
    value: [122.844287, 45.625709]
  },
  {
    name: '哈尔滨市 - 双城区',
    value: [126.323072, 45.388314]
  },
  {
    name: '哈尔滨市 - 五常市',
    value: [127.138459, 44.928654]
  },
  {
    name: '齐齐哈尔市 - 富裕县',
    value: [124.479967, 47.780035]
  },
  {
    name: '鸡西市 - 梨树区',
    value: [130.703683, 45.098651]
  },
  {
    name: '绥化市 - 肇东市',
    value: [125.965087, 46.058338]
  },
  {
    name: '上海市 - 闵行区',
    value: [121.388612, 31.120079]
  },
  {
    name: '上海市 - 松江区',
    value: [121.23333, 31.037877]
  },
  {
    name: '上海市 - 青浦区',
    value: [121.129978, 31.155701]
  },
  {
    name: '南京市',
    value: [118.800122, 32.064408]
  },
  {
    name: '徐州市 - 沛县',
    value: [116.942586, 34.764915]
  },
  {
    name: '徐州市 - 睢宁县',
    value: [117.948008, 33.919508]
  },
  {
    name: '南通市 - 海安县',
    value: [120.473858, 32.537979]
  },
  {
    name: '连云港市 - 赣榆区',
    value: [119.181735, 34.849815]
  },
  {
    name: '盐城市 - 亭湖区',
    value: [120.204003, 33.396134]
  },
  {
    name: '盐城市 - 射阳县',
    value: [120.262721, 33.780294]
  },
  {
    name: '盐城市 - 东台市',
    value: [120.325962, 32.872473]
  },
  {
    name: '泰州市 - 兴化市',
    value: [119.860389, 32.917097]
  },
  {
    name: '宿迁市 - 泗洪县',
    value: [118.222991, 33.465492]
  },
  {
    name: '杭州市 - 建德市',
    value: [119.287398, 29.482412]
  },
  {
    name: '宁波市',
    value: [121.625697, 29.865281]
  },
  {
    name: '嘉兴市',
    value: [120.755503, 30.75172]
  },
  {
    name: '湖州市',
    value: [120.083019, 30.900699]
  },
  {
    name: '衢州市',
    value: [118.870047, 28.976304]
  },
  {
    name: '淮南市',
    value: [117.004664, 32.63209]
  },
  {
    name: '阜阳市 - 阜南县',
    value: [115.603121, 32.66434]
  },
  {
    name: '阜阳市 - 颍上县',
    value: [116.263477, 32.659271]
  },
  {
    name: '宿州市 - 埇桥区',
    value: [116.985205, 33.64565]
  },
  {
    name: '宿州市 - 萧县',
    value: [116.95646, 34.195463]
  },
  {
    name: '六安市 - 霍邱县',
    value: [116.285526, 32.36016]
  },
  {
    name: '宣城市 - 宣州区',
    value: [118.765424, 30.946459]
  },
  {
    name: '福州市 - 福清市',
    value: [119.39219, 25.726083]
  },
  {
    name: '三明市',
    value: [117.647246, 26.269996]
  },
  {
    name: '泉州市',
    value: [118.677847, 24.880214]
  },
  {
    name: '漳州市',
    value: [117.654151, 24.521297]
  },
  {
    name: '龙岩市',
    value: [117.022298, 25.081482]
  },
  {
    name: '南昌市',
    value: [115.866889, 28.688188]
  },
  {
    name: '景德镇市 - 乐平市',
    value: [117.181701, 29.275004]
  },
  {
    name: '九江市 - 德安县',
    value: [115.763153, 29.320432]
  },
  {
    name: '宜春市',
    value: [114.428163, 27.824179]
  },
  {
    name: '抚州市 - 南城县',
    value: [116.641674, 27.577522]
  },
  {
    name: '济南市 - 长清区',
    value: [116.757237, 36.561839]
  },
  {
    name: '青岛市 - 即墨市',
    value: [120.453536, 36.396376]
  },
  {
    name: '枣庄市 - 市中区',
    value: [117.561416, 34.869726]
  },
  {
    name: '东营市 - 河口区',
    value: [118.53308, 37.890892]
  },
  {
    name: '烟台市 - 莱阳市',
    value: [120.717839, 36.985789]
  },
  {
    name: '济宁市 - 金乡县',
    value: [116.32083, 35.072805]
  },
  {
    name: '济宁市 - 泗水县',
    value: [117.257429, 35.669427]
  },
  {
    name: '济宁市 - 邹城市',
    value: [116.949726, 35.379509]
  },
  {
    name: '威海市 - 文登区',
    value: [122.063853, 37.198503]
  },
  {
    name: '莱芜市 - 莱城区',
    value: [117.665441, 36.208142]
  },
  {
    name: '临沂市 - 临沭县',
    value: [118.66037, 34.924362]
  },
  {
    name: '德州市 - 夏津县',
    value: [116.011409, 36.953001]
  },
  {
    name: '聊城市 - 莘县',
    value: [115.678547, 36.240606]
  },
  {
    name: '滨州市 - 惠民县',
    value: [117.51766, 37.4942]
  },
  {
    name: '菏泽市',
    value: [115.48812, 35.236813]
  },
  {
    name: '菏泽市 - 曹县',
    value: [115.547882, 34.830624]
  },
  {
    name: '菏泽市 - 巨野县',
    value: [116.099299, 35.40371]
  },
  {
    name: '开封市 - 祥符区',
    value: [114.448162, 34.762784]
  },
  {
    name: '洛阳市 - 洛宁县',
    value: [111.659012, 34.395223]
  },
  {
    name: '平顶山市 - 郏县',
    value: [113.218456, 33.976289]
  },
  {
    name: '安阳市 - 内黄县',
    value: [114.907014, 35.975314]
  },
  {
    name: '新乡市 - 获嘉县',
    value: [113.659393, 35.26463]
  },
  {
    name: '新乡市 - 原阳县',
    value: [113.947199, 35.070928]
  },
  {
    name: '新乡市 - 卫辉市',
    value: [114.069301, 35.438189]
  },
  {
    name: '焦作市 - 修武县',
    value: [113.455732, 35.228143]
  },
  {
    name: '濮阳市 - 濮阳县',
    value: [115.038459, 35.716717]
  },
  {
    name: '漯河市 - 郾城区',
    value: [114.013969, 33.592935]
  },
  {
    name: '南阳市 - 西峡县',
    value: [111.477523, 33.31404]
  },
  {
    name: '南阳市 - 唐河县',
    value: [112.813999, 32.686992]
  },
  {
    name: '南阳市 - 邓州市',
    value: [112.078472, 32.689785]
  },
  {
    name: '商丘市 - 虞城县',
    value: [115.832748, 34.40557]
  },
  {
    name: '信阳市 - 固始县',
    value: [115.662788, 32.17393]
  },
  {
    name: '周口市 - 西华县',
    value: [114.532722, 33.772015]
  },
  {
    name: '周口市 - 商水县',
    value: [114.621291, 33.548636]
  },
  {
    name: '驻马店市 - 新蔡县',
    value: [114.994769, 32.754055]
  },
  {
    name: '武汉市 - 黄陂区',
    value: [114.382454, 30.886294]
  },
  {
    name: '武汉市 - 新洲区',
    value: [114.810993, 30.846004]
  },
  {
    name: '宜昌市 - 夷陵区',
    value: [111.329655, 30.775081]
  },
  {
    name: '襄阳市 - 樊城区',
    value: [112.140874, 32.050327]
  },
  {
    name: '襄阳市 - 老河口市',
    value: [111.68558, 32.392216]
  },
  {
    name: '荆门市 - 京山县',
    value: [113.127123, 31.028044]
  },
  {
    name: '孝感市 - 安陆市',
    value: [113.693283, 31.26265]
  },
  {
    name: '孝感市 - 汉川市',
    value: [113.844399, 30.667162]
  },
  {
    name: '荆州市 - 荆州区',
    value: [112.194689, 30.359238]
  },
  {
    name: '荆州市 - 石首市',
    value: [112.43027, 29.725779]
  },
  {
    name: '黄冈市 - 团风县',
    value: [114.877949, 30.649119]
  },
  {
    name: '黄冈市 - 浠水县',
    value: [115.275019, 30.458706]
  },
  {
    name: '黄冈市 - 麻城市',
    value: [115.017712, 31.177243]
  },
  {
    name: '随州市 - 随县',
    value: [113.308811, 31.863303]
  },
  {
    name: '仙桃市',
    value: [113.463316, 30.370017]
  },
  {
    name: '常德市 - 安乡县',
    value: [112.195903, 29.471419]
  },
  {
    name: '常德市 - 桃源县',
    value: [111.495407, 28.909453]
  },
  {
    name: '郴州市',
    value: [112.976042, 25.74206]
  },
  {
    name: '永州市',
    value: [111.62003, 26.42664]
  },
  {
    name: '广州市 - 白云区',
    value: [113.278283, 23.164583]
  },
  {
    name: '深圳市 - 福田区',
    value: [114.063847, 22.528733]
  },
  {
    name: '珠海市 - 斗门区',
    value: [113.303467, 22.213642]
  },
  {
    name: '佛山市 - 南海区',
    value: [113.129324, 23.028891]
  },
  {
    name: '茂名市 - 高州市',
    value: [110.859474, 21.924854]
  },
  {
    name: '南宁市',
    value: [108.374026, 22.822341]
  },
  {
    name: '桂林市',
    value: [110.201245, 25.24367]
  },
  {
    name: '玉林市',
    value: [110.187303, 22.659031]
  },
  {
    name: '海口市 - 秀英区',
    value: [110.302736, 20.014457]
  },
  {
    name: '三亚市 - 天涯区',
    value: [109.463926, 18.307403]
  },
  {
    name: '文昌市',
    value: [110.799335, 19.54988]
  },
  {
    name: '重庆市 - 万州区',
    value: [108.414983, 30.81387]
  },
  {
    name: '重庆市 - 南川区',
    value: [107.104435, 29.163227]
  },
  {
    name: '重庆市 - 垫江县',
    value: [107.337266, 30.333543]
  },
  {
    name: '成都市 - 龙泉驿区',
    value: [104.282547, 30.562449]
  },
  {
    name: '自贡市 - 沿滩区',
    value: [104.882134, 29.279553]
  },
  {
    name: '绵阳市 - 涪城区',
    value: [104.683507, 31.47388]
  },
  {
    name: '内江市 - 市中区',
    value: [105.067675, 29.584418]
  },
  {
    name: '乐山市 - 市中区',
    value: [103.776183, 29.558599]
  },
  {
    name: '贵阳市',
    value: [106.637727, 26.6541]
  },
  {
    name: '遵义市',
    value: [106.934578, 27.731445]
  },
  {
    name: '安顺市',
    value: [105.951542, 26.257438]
  },
  {
    name: '昆明市 - 盘龙区',
    value: [102.759676, 25.121063]
  },
  {
    name: '玉溪市 - 通海县',
    value: [102.731273, 24.118155]
  },
  {
    name: '红河哈尼族彝族自治州 - 建水县',
    value: [102.83229, 23.642793]
  },
  {
    name: '大理白族自治州 - 大理市',
    value: [100.235369, 25.596823]
  },
  {
    name: '大理白族自治州 - 祥云县',
    value: [100.555722, 25.48909]
  },
  {
    name: '铜川市 - 耀州区',
    value: [108.986438, 34.91525]
  },
  {
    name: '宝鸡市 - 陈仓区',
    value: [107.392863, 34.359564]
  },
  {
    name: '咸阳市 - 兴平市',
    value: [108.497544, 34.305716]
  },
  {
    name: '渭南市 - 富平县',
    value: [109.191036, 34.757972]
  },
  {
    name: '商洛市 - 山阳县',
    value: [109.889124, 33.537727]
  },
  {
    name: '天水市 - 麦积区',
    value: [105.895597, 34.578001]
  },
  {
    name: '武威市 - 凉州区',
    value: [102.643401, 37.933553]
  },
  {
    name: '武威市 - 民勤县',
    value: [103.09925, 38.630851]
  },
  {
    name: '张掖市 - 甘州区',
    value: [100.482833, 38.934108]
  },
  {
    name: '定西市 - 安定区',
    value: [104.627998, 35.585835]
  },
  {
    name: '银川市 - 兴庆区',
    value: [106.295494, 38.478901]
  },
  {
    name: '吴忠市 - 利通区',
    value: [106.219407, 37.990519]
  },
  {
    name: '中卫市 - 沙坡头区',
    value: [105.165052, 37.580094]
  },
  {
    name: '乌鲁木齐市',
    value: [87.612367, 43.831387]
  },
  {
    name: '昌吉回族自治州 - 玛纳斯县',
    value: [86.223518, 44.310682]
  },
  {
    name: '博尔塔拉蒙古自治州 - 博乐市',
    value: [82.057972, 44.861032]
  },
  {
    name: '巴音郭楞蒙古自治州 - 库尔勒市',
    value: [86.181494, 41.73388]
  },
  {
    name: '阿克苏地区',
    value: [80.262919, 41.175682]
  },
  {
    name: '喀什地区',
    value: [75.994091, 39.476765]
  },
  {
    name: '和田地区',
    value: [79.864116, 37.090283]
  },
  {
    name: '伊犁哈萨克自治州',
    value: [81.325364, 43.927086]
  },
  {
    name: '西宁市',
    value: [101.7833, 36.62269]
  },
  {
    name: '拉萨市',
    value: [91.119674, 29.650291]
  }
]
