export default {
  yAxis: [
    '仙桃流动蛋鸡超市',
    '高唐流动蛋鸡超市',
    '莘县流动蛋鸡超市',
    '平谷分店流动蛋鸡超市',
    '邱县流动蛋鸡超市',
    '虞城流动蛋鸡超市',
    '唐洋流动蛋鸡超市',
    '隆尧流动蛋鸡超市',
    '榆次流动蛋鸡超市',
    '沙河流动蛋鸡超市'
  ].reverse(),
  series: [
    {
      name: '疫苗',
      data: [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ].reverse()
    },
    {
      name: '雏鸡',
      data: [
        2356545.05,
        3241362.50,
        1764331.95,
        780797.50,
        2126280.35,
        487140.00,
        2018235.00,
        968161.65,
        2024346.00,
        719145.60
      ].reverse()
    },
    {
      name: '饲料',
      data: [
        2733169.60,
        88387.50,
        1526018.00,
        2220522.70,
        846879.93,
        2274665.70,
        724095.70,
        1679648.80,
        616005.48,
        1677111.45
      ].reverse()
    }
  ]
}
