export default {
  yAxis: [
    '榆次流动蛋鸡超市',
    '仙桃流动蛋鸡超市',
    '莘县流动蛋鸡超市',
    '邱县流动蛋鸡超市',
    '高唐流动蛋鸡超市',
    '唐洋流动蛋鸡超市',
    '馆陶县流动蛋鸡超市',
    '开封流动蛋鸡超市',
    '隆尧流动蛋鸡超市',
    '平谷流动蛋鸡超市分店超市'
  ].reverse(),
  series: [
    {
      name: '疫苗',
      data: [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ].reverse()
    },
    {
      name: '雏鸡',
      data: [
        2398038.00,
        2864564.35,
        2925236.85,
        3709997.85,
        4474772.00,
        3460656.60,
        3341676.20,
        2104524.65,
        1498161.65,
        826687.50
      ].reverse()
    },
    {
      name: '饲料',
      data: [
        4633726.80,
        3245629.60,
        1863016.50,
        934285.63,
        111372.50,
        991208.65,
        828391.85,
        1569125.60,
        2159748.00,
        2803296.70
      ].reverse()
    }
  ]
}
