export default {
  yAxis: [
    '谢崇兵超市',
    '郭士贞超市',
    '邱县流动蛋鸡超市',
    '胡彦强超市',
    '馆陶县流动蛋鸡超市',
    '莘县流动蛋鸡超市',
    '肇庆流动蛋鸡超市',
    '德州流动蛋鸡超市',
    '煜江南超市-6000896',
    '海安超市-5001079'
  ].reverse(),
  series: [
    {
      name: '雏鸡',
      data: [
        878689293.5,
        4382570,
        3823760,
        3479734.65,
        3018366.4,
        2713020,
        2690836,
        2506435,
        2459620,
        2406964
      ].reverse()
    },
    {
      name: '饲料',
      data: [
        0,
        0,
        0,
        0,
        0,
        32800,
        0,
        0,
        0,
        0
      ].reverse()
    },
    {
      name: '疫苗',
      data: [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ].reverse()
    }
  ]
}
