/* eslint-disable */

export default [
  {"name":"湖南","hong":"0 ","fen":"1450 ","bai":"0 ","all":"1450 "},
  {"name":"广东","hong":"1 ","fen":"30 ","bai":"0 ","all":"31 "},
  {"name":"广西","hong":"3 ","fen":"35 ","bai":"0 ","all":"38 "},
  {"name":"上海","hong":"14 ","fen":"5 ","bai":"0 ","all":"19 "},
  {"name":"海南","hong":"2 ","fen":"15 ","bai":"0 ","all":"17 "},
  {"name":"重庆","hong":"65 ","fen":"712 ","bai":"0 ","all":"777 "},
  {"name":"贵州","hong":"2 ","fen":"270 ","bai":"0 ","all":"272 "},
  {"name":"四川","hong":"103 ","fen":"1527 ","bai":"0 ","all":"1630 "},
  {"name":"江西","hong":"1200 ","fen":"400 ","bai":"0 ","all":"1600 "},
  {"name":"福建","hong":"500 ","fen":"50 ","bai":"0 ","all":"550 "},
  {"name":"湖北","hong":"1520 ","fen":"1640 ","bai":"0 ","all":"3160 "},
  {"name":"安徽","hong":"3200 ","fen":"3100 ","bai":"0 ","all":"6300 "},
  {"name":"云南","hong":"815 ","fen":"1225 ","bai":"0 ","all":"2040 "},
  {"name":"内蒙","hong":"3250 ","fen":"25 ","bai":"0 ","all":"3275 "},
  {"name":"甘肃","hong":"2800 ","fen":"0 ","bai":"0 ","all":"2800 "},
  {"name":"宁夏","hong":"1750 ","fen":"40 ","bai":"0 ","all":"1790 "},
  {"name":"北京","hong":"750 ","fen":"75 ","bai":"0 ","all":"825 "},
  {"name":"江苏","hong":"15000 ","fen":"3000 ","bai":"0 ","all":"18000 "},
  {"name":"青海","hong":"100 ","fen":"0 ","bai":"0 ","all":"100 "},
  {"name":"新疆","hong":"750 ","fen":"0 ","bai":"0 ","all":"750 "},
  {"name":"山西","hong":"4000 ","fen":"116 ","bai":"20 ","all":"4136 "},
  {"name":"山东","hong":"17500 ","fen":"875 ","bai":"925 ","all":"19300 "},
  {"name":"吉林","hong":"2600 ","fen":"800 ","bai":"100 ","all":"3500 "},
  {"name":"浙江","hong":"400 ","fen":"50 ","bai":"10 ","all":"460 "},
  {"name":"河北","hong":"11570 ","fen":"14880 ","bai":"695 ","all":"27145 "},
  {"name":"河南","hong":"11750 ","fen":"475 ","bai":"340 ","all":"12565 "},
  {"name":"黑龙江","hong":"2700 ","fen":"200 ","bai":"50 ","all":"2950 "},
  {"name":"陕西","hong":"4500 ","fen":"175 ","bai":"25 ","all":"4700 "},
  {"name":"辽宁","hong":"13800 ","fen":"250 ","bai":"33 ","all":"14083 "},
  {"name":"天津","hong":"1500 ","fen":"50 ","bai":"100 ","all":"1650 "}
].map(e => ({
  name: e.name,
  value: e.all
}))